# markdown
## markdown
### markdown
#### markdown
# __markdown__
# markdown
b두번 삭제     #이때 줄바꿈을 하려면 띄어쓰기 두번+enter 누르면 됌 or <br>을 치든가 (html과 유사한 방법)
b는 위 추가  
a는 아래 추가<br>
enter 들어가기  
esc 나가기  
m은 markdown 버전  
y는 code 버전  

- 1주차 study
+ 1주차 study 
* 1주차 study

목록 안의 목록(tab누르면 됌)
- 1주차 study
    + 1주차 study 
        * 1주차 study

$$중간에 쓰기$$ 
  
$수식어 쓰기 -> a^2+b^2=c^2$  방법: ###$ 사이에 존재하면 됌
  
##### 4.수평선  
----------------
* * *
***
- - -

##### 5. 강조
*기울어진 글씨*  
_기울어진 글씨_  
**굵은 글씨**  
__굵은 글씨__  
그냥 글씨  
~~줄 그어진 글씨~~

In [3]:
#ctrl+enter :실행
#shift+enter : 실행+ 다음 cell로 이동
#alt+enter :실행 후 아래 cell 추가하고 이동한다.

In [6]:
###pandas Tutorial of Colab
####pandas import
import pandas as pd
pd.__version__

'1.0.1'

In [13]:
city_names = pd.Series(['San Francisco', 'San Jose', 'Sacramento'])

In [11]:
population = pd.Series([852469, 1015785, 485199])

In [14]:
pd.DataFrame({ 'City name': city_names, 'Population': population })

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacramento      485199

In [18]:
dataset_url="https://download.mlcc.google.com/mledu-datasets/california_housing_train.csv"
california_housing_dataframe = pd.read_csv(dataset_url, sep=",") #csv는 확장자(','로 구분)
california_housing_dataframe.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000
mean,-119.562108,35.625225,28.589353,2643.664412,539.410824,1429.573941,501.221941,3.883578,207300.912353
std,2.005166,2.137340,12.586937,2179.947071,421.499452,1147.852959,384.520841,1.908157,115983.764387
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.790000,33.930000,18.000000,1462.000000,297.000000,790.000000,282.000000,2.566375,119400.000000
50%,-118.490000,34.250000,29.000000,2127.000000,434.000000,1167.000000,409.000000,3.544600,180400.000000
75%,-118.000000,37.720000,37.000000,3151.250000,648.250000,1721.000000,605.250000,4.767000,265000.000000
max,-114.310000,41.950000,52.000000,37937.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [19]:
#.head()라는 것은 상위 5개 행(row)를 보여준다. .head(10)하면 10개를 보여줌
#describe 표 전체를 보여줌
california_housing_dataframe.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0

In [22]:
#.hist()
colume_name='house_median_age'
california_housing_dataframe.hist(colume_namecalifornia_housing_dataframe.hist('housing_median_age'))

NameError: name 'colume_namecalifornia_housing_dataframe' is not defined

In [23]:
cities = pd.DataFrame({ 'City name': city_names, 'Population': population })
print(type(cities['City name']))
#cities(DataFrame)[colume name] => colume명에 해당하는 Series가 return
cities['City name']

<class 'pandas.core.series.Series'>

0    San Francisco
1         San Jose
2       Sacramento
Name: City name, dtype: object

In [24]:
print(type(cities['City name'][1]))
cities['City name'][1] #slice-> colume (열)

<class 'str'>

'San Jose'

In [25]:
print(type(cities[0:2])) #cities라는 DataFrame 0~1 interator data
cities[0:2] #slice -> row(행)에 대해여

<class 'pandas.core.frame.DataFrame'>

       City name  Population
0  San Francisco      852469
1       San Jose     1015785

In [26]:
population / 1000.

0     852.469
1    1015.785
2     485.199
dtype: float64

In [28]:
cities['Area square miles'] = pd.Series([46.87, 176.53, 97.92]) #열(colume)을 추가해주는 방법임.
cities

       City name  Population  Area square miles
0  San Francisco      852469              46.87
1       San Jose     1015785             176.53
2     Sacramento      485199              97.92

In [29]:
cities['Population density'] = cities['Population'] / cities['Area square miles'] #얘도 열이 추가됌
cities

       City name  Population  Area square miles  Population density
0  San Francisco      852469              46.87        18187.945381
1       San Jose     1015785             176.53         5754.177760
2     Sacramento      485199              97.92         4955.055147

#실습 #1
다음 두 명제 모두 True인 경우에만 True인 새 부울 열을 추가하여 도시 테이블을 수정합니다.

도시 이름은 성인의 이름을 본따서 지었다.
도시 면적이 130제곱킬로미터보다 넓다.
참고: 부울 Series는 기존 부울 연산자가 아닌 비트 연산자를 사용하여 결합할 수 있습니다. 예를 들어 logical and를 실행할 때 and 대신 &를 사용합니다.

참고: 스페인어에서 "San"은 "성인"의 의미입니다.

In [30]:
#실습 1
cities[cities['Population']>500000]  #cities라는 dataFrame에서 cities의 Population이
                                    # 50000 넘는 것만 추려서 출력

       City name  Population  Area square miles  Population density
0  San Francisco      852469              46.87        18187.945381
1       San Jose     1015785             176.53         5754.177760

In [41]:
#cities 열 추가
cities['Boolean_test']=cities['City name'].str.contains('San') & (cities['Area square miles']>130)

In [42]:
cities

,City name,Population,Area square miles,Population density,Boolean_test
0,San Francisco,852469,46.87,18187.945381,False
1,San Jose,1015785,176.53,5754.177760,True
2,Sacramento,485199,97.92,4955.055147,False

In [ ]:
#색인

In [ ]:
#1숙제 10minuutes to pandas  -> 실습해보기 다음 주 수업시간까지(1/13(수)) (2~3시간 소요)